## merge() function

In [ ]:
Join two DataFrames like SQL tables.There are different types of joins in merge.

In [ ]:
# 1. Inner Join >> Returns only matching records from both DataFrames

In [3]:
import pandas as pd

# City population data
population = pd.DataFrame({
    'City': ['Mumbai', 'Delhi', 'Bengaluru', 'Chennai'],
    'Population (M)': [20.4, 19.1, 13.5, 11.5]
})

# Tourism data
tourism = pd.DataFrame({
    'City': ['Mumbai', 'Delhi', 'Jaipur'],
    'Annual Tourists (M)': [5.8, 6.2, 3.5]
})

inner_merged = pd.merge(population, tourism, on='City', how='inner')

# Specifies the key column(s) used to merge DataFrames.


print(population)
print("*"*40)
print(tourism)
print("*"*40)
print("Inner Join Result:")
print(inner_merged)

        City  Population (M)
0     Mumbai            20.4
1      Delhi            19.1
2  Bengaluru            13.5
3    Chennai            11.5
****************************************
     City  Annual Tourists (M)
0  Mumbai                  5.8
1   Delhi                  6.2
2  Jaipur                  3.5
****************************************
Inner Join Result:
     City  Population (M)  Annual Tourists (M)
0  Mumbai            20.4                  5.8
1   Delhi            19.1                  6.2

In [ ]:
# 2. Left Join
Returns all records from left DF + matching from right DF

In [4]:
left_merged = pd.merge(population, tourism, on='City', how='left')
print("\nLeft Join Result:")
print(left_merged)

Left Join Result:
        City  Population (M)  Annual Tourists (M)
0     Mumbai            20.4                  5.8
1      Delhi            19.1                  6.2
2  Bengaluru            13.5                  NaN
3    Chennai            11.5                  NaN

In [ ]:
# 3. Right Join
Returns all records from right DF + matching records from left DF

In [5]:
right_merged = pd.merge(population, tourism, on='City', how='right')
print("\nRight Join Result:")
print(right_merged)

Right Join Result:
     City  Population (M)  Annual Tourists (M)
0  Mumbai            20.4                  5.8
1   Delhi            19.1                  6.2
2  Jaipur             NaN                  3.5

In [ ]:
# 4. Outer Join
Returns all records from both DFs

In [6]:
outer_merged = pd.merge(population, tourism, on='City', how='outer')
print("\nOuter Join Result:")
print(outer_merged)

Outer Join Result:
        City  Population (M)  Annual Tourists (M)
0     Mumbai            20.4                  5.8
1      Delhi            19.1                  6.2
2  Bengaluru            13.5                  NaN
3    Chennai            11.5                  NaN
4     Jaipur             NaN                  3.5

In [1]:
import pandas as pd
import numpy as np

#sample dataset
data = {
    'emp_id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'name': ['Aarav Sharma', 'Priya Patel', 'Rohan Singh', 'Anjali Gupta', 
            'Vikram Reddy', 'Neha Desai', 'Arun Kumar', 'Deepika Iyer', 
            'Suresh Menon', 'Kavita Joshi'],
    'city': ['Mumbai', 'Delhi', 'Bangalore', 'Mumbai', 'Chennai', 
            'Delhi', 'Kolkata', 'Hyderabad', 'Pune', 'Ahmedabad'],
    'salary': [75000, 92000, 68000, 115000, 82000, 
              55000, 98000, 72000, 105000, 61000],
    'department': ['Sales', 'HR', 'IT', 'Sales', 'IT', 
                  'Marketing', 'IT', 'HR', 'Sales', 'Marketing'],
    'experience': [3, 5, 2, 7, 4, 1, 6, 2, 8, 3]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
df

Original DataFrame:
   emp_id          name       city  salary department  experience
0     101  Aarav Sharma     Mumbai   75000      Sales           3
1     102   Priya Patel      Delhi   92000         HR           5
2     103   Rohan Singh  Bangalore   68000         IT           2
3     104  Anjali Gupta     Mumbai  115000      Sales           7
4     105  Vikram Reddy    Chennai   82000         IT           4
5     106    Neha Desai      Delhi   55000  Marketing           1
6     107    Arun Kumar    Kolkata   98000         IT           6
7     108  Deepika Iyer  Hyderabad   72000         HR           2
8     109  Suresh Menon       Pune  105000      Sales           8
9     110  Kavita Joshi  Ahmedabad   61000  Marketing           3

   emp_id          name       city  salary department  experience
0     101  Aarav Sharma     Mumbai   75000      Sales           3
1     102   Priya Patel      Delhi   92000         HR           5
2     103   Rohan Singh  Bangalore   68000         IT           2
3     104  Anjali Gupta     Mumbai  115000      Sales           7
4     105  Vikram Reddy    Chennai   82000         IT           4
5     106    Neha Desai      Delhi   55000  Marketing           1
6     107    Arun Kumar    Kolkata   98000         IT           6
7     108  Deepika Iyer  Hyderabad   72000         HR           2
8     109  Suresh Menon       Pune  105000      Sales           8
9     110  Kavita Joshi  Ahmedabad   61000  Marketing           3

## apply() Function

The apply() function lets you apply a custom function to each element, row, or column of a DataFrame/Series

In [2]:
#10% bonus to employees.
df["updated_salary"] = df["salary"].apply(lambda x: x * 1.10)
print(df[["name","salary","updated_salary"]])

           name  salary  updated_salary
0  Aarav Sharma   75000         82500.0
1   Priya Patel   92000        101200.0
2   Rohan Singh   68000         74800.0
3  Anjali Gupta  115000        126500.0
4  Vikram Reddy   82000         90200.0
5    Neha Desai   55000         60500.0
6    Arun Kumar   98000        107800.0
7  Deepika Iyer   72000         79200.0
8  Suresh Menon  105000        115500.0
9  Kavita Joshi   61000         67100.0

In [3]:
def experience_level(x):
    return "Senior" if x >= 5 else "Junior"

df["emp_level"] = df["experience"].apply(experience_level)
print(df[["name", "experience", "emp_level"]])

           name  experience emp_level
0  Aarav Sharma           3    Junior
1   Priya Patel           5    Senior
2   Rohan Singh           2    Junior
3  Anjali Gupta           7    Senior
4  Vikram Reddy           4    Junior
5    Neha Desai           1    Junior
6    Arun Kumar           6    Senior
7  Deepika Iyer           2    Junior
8  Suresh Menon           8    Senior
9  Kavita Joshi           3    Junior

In [ ]:
#Calculate annual bonus (5% of salary)

In [5]:
df['bonus'] = df['salary'].apply(lambda x: x * 0.05)
print("\nWith Bonus Column:")
print(df[['name', 'salary', 'bonus']].head(3))

With Bonus Column:
           name  salary   bonus
0  Aarav Sharma   75000  3750.0
1   Priya Patel   92000  4600.0
2   Rohan Singh   68000  3400.0

In [4]:
df[['bonus']]

    bonus
0  3750.0
1  4600.0
2  3400.0
3  5750.0
4  4100.0
5  2750.0
6  4900.0
7  3600.0
8  5250.0
9  3050.0

## Sorting

In [ ]:
Organize data by column values

In [10]:
#Sort by salary (descending)
sorted_salary = df.sort_values('salary', ascending=False)
print("\nTop 3 Salaries:")
print(sorted_salary[['name', 'salary']].head(3))

Top 3 Salaries:
           name  salary
3  Anjali Gupta  115000
8  Suresh Menon  105000
6    Arun Kumar   98000

## Aggregate (agg())

In [ ]:
>> The aggregate() function allows you to apply multiple aggregation functions 
  (like min, max, sum, mean, etc.) at the same time on grouped data.
>> Instead of writing many lines of code for different stats, you get everything in one go.

In [7]:
salary_stats = df.agg({
    'salary': ['sum', 'mean'],
    'emp_id': 'count'
})
print("\nSalary Statistics:")
print(salary_stats)

Salary Statistics:
         salary  emp_id
sum    823000.0     NaN
mean    82300.0     NaN
count       NaN    10.0

## groupby()

In [ ]:
>> to Analyze data by categories
>> The groupby() function splits data into groups based on some column(s), 
then lets you perform calculations on each group.
>>

In [4]:
# Average salary by department
dept_salary = df.groupby("department")["salary"].mean()
print(dept_salary)

department
HR           82000.000000
IT           82666.666667
Marketing    58000.000000
Sales        98333.333333
Name: salary, dtype: float64

In [5]:
#Employee count per city

city_count = df.groupby("city")["emp_id"].count()
print(city_count)

city
Ahmedabad    1
Bangalore    1
Chennai      1
Delhi        2
Hyderabad    1
Kolkata      1
Mumbai       2
Pune         1
Name: emp_id, dtype: int64

In [6]:
#Min, Max, Mean salary by department
dept_stats = df.groupby("department")["salary"].agg(["min", "max", "mean"])
print(dept_stats)

              min     max          mean
department
HR          72000   92000  82000.000000
IT          68000   98000  82666.666667
Marketing   55000   61000  58000.000000
Sales       75000  115000  98333.333333

In [14]:
#Total salary & Avg experience by department
dept_summary = df.groupby("department").agg({
    "salary": "sum",
    "experience": "mean"
})
print(dept_summary)

Department-City Combined Analysis:
                      salary                   experience
                         min     max    median       mean count
department city
HR         Delhi       92000   92000   92000.0        5.0     1
           Hyderabad   72000   72000   72000.0        2.0     1
IT         Bangalore   68000   68000   68000.0        2.0     1
           Chennai     82000   82000   82000.0        4.0     1
           Kolkata     98000   98000   98000.0        6.0     1
Marketing  Ahmedabad   61000   61000   61000.0        3.0     1
           Delhi       55000   55000   55000.0        1.0     1
Sales      Mumbai      75000  115000   95000.0        5.0     2
           Pune       105000  105000  105000.0        8.0     1

## Renaming Columns

In [ ]:
>>> Improve column readability

In [15]:
df_renamed = df.rename(columns={'emp_id': 'employee_id'})
print("\nRenamed emp_id column:")
print(df_renamed.columns)

Renamed emp_id column:
Index(['employee_id', 'name', 'city', 'salary', 'department', 'experience',
       'bonus'],
      dtype='object')

In [ ]:
pivot table, concatenate,

## pivot_table

summarizes data into a table format, very similar to Excel pivot tables. You choose rows, columns, values, and an aggregation function.

In [8]:
pivot2 = pd.pivot_table(df, values="salary", index="city", columns="department", aggfunc="sum", fill_value=0)
print(pivot2)

department     HR     IT  Marketing   Sales
city
Ahmedabad       0      0      61000       0
Bangalore       0  68000          0       0
Chennai         0  82000          0       0
Delhi       92000      0      55000       0
Hyderabad   72000      0          0       0
Kolkata         0  98000          0       0
Mumbai          0      0          0  190000
Pune            0      0          0  105000